# Data Analysis
Notebook overview:
- data loading
- exploration
- adding indicators

First we start off with exploring and analysing our data.

Using: pandas, numpy, seaborn.

In [49]:
import pandas as pd
import numpy as np
import seaborn as sns
from utils import *

# NASDAQ

In [40]:
data_dir = '../data/'
nasdaq = pd.read_csv(data_dir + 'NASDAQ/Composite-2015-2019-D1.csv')

In [41]:
nasdaq.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2015-01-02,4760.240234,4777.009766,4698.109863,4726.810059,4726.810059,1435150000
1,2015-01-05,4700.339844,4702.770020,4641.459961,4652.569824,4652.569824,1794470000
2,2015-01-06,4666.850098,4667.330078,4567.589844,4592.740234,4592.740234,2167320000
3,2015-01-07,4626.839844,4652.720215,4613.899902,4650.470215,4650.470215,1957950000
4,2015-01-08,4689.540039,4741.379883,4688.020020,4736.189941,4736.189941,2105450000

## Adj Close
According to Yahoo! Finance specification:
- *Close* -- Close price adjusted for splits.
- *Adj Close* -- Adjusted close price adjusted for both dividends and splits.

We can see that these two columns have exact same values. Let's check whether it is true for the whole dataset.

In [42]:
len(nasdaq)

1259

In [43]:
close = np.array(nasdaq['Adj Close'])
adj_close = np.array(nasdaq['Close'])

In [44]:
(close == adj_close).sum()

1259

In [45]:
nasdaq.drop(['Adj Close'], axis=1, inplace=True)

In [46]:
nasdaq.head()

         Date         Open         High          Low        Close      Volume
0  2015-01-02  4760.240234  4777.009766  4698.109863  4726.810059  1435150000
1  2015-01-05  4700.339844  4702.770020  4641.459961  4652.569824  1794470000
2  2015-01-06  4666.850098  4667.330078  4567.589844  4592.740234  2167320000
3  2015-01-07  4626.839844  4652.720215  4613.899902  4650.470215  1957950000
4  2015-01-08  4689.540039  4741.379883  4688.020020  4736.189941  2105450000

# EURUSD

In [50]:
eurusd = load_file_split(data_dir + 'EURUSD/')

In [51]:
eurusd

         Date   Time     Open   High      Low  Close  Ticks
0  2018.01.01  17:00  1.20037  1.201  1.20037  1.201      0